src/Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХарактеристикиНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХарактеристикаНоменклатурыДляЦенообразования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатурыДляЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ИС_MP_ВыгрузкаКарточек/Ext/Module.bsl
// fiture1


#Область ПрограммныйИнтерфейс
       
//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция ЕстьВидНоменклатурыУХарактеристики() Экспорт

	Возврат Метаданные.Справочники["ХарактеристикиНоменклатуры"].Реквизиты.Найти("ВидНоменклатуры") <> Неопределено;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция ДопРеквизитыНабора(НаборДопРеквизитов = Неопределено) Экспорт

	Если НаборДопРеквизитов = Неопределено Тогда

		НаименованияЭлементовСправочника = Новый Массив;
		НаименованияЭлементовСправочника.Добавить("Номенклатура");
		НаименованияЭлементовСправочника.Добавить("Справочник ""Номенклатура""");
		//т.к. с версии 11.5 имеются предопределенные и непредопределенные элементы с одним наименованием
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НаборыДополнительныхРеквизитовИСведений.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.НаборыДополнительныхРеквизитовИСведений КАК НаборыДополнительныхРеквизитовИСведений
		|ГДЕ
		|	НаборыДополнительныхРеквизитовИСведений.Наименование В (&НаименованияЭлементовСправочника)";

		Запрос.УстановитьПараметр("НаименованияЭлементовСправочника", НаименованияЭлементовСправочника);

		РезультатЗапроса = Запрос.Выполнить().Выгрузить();

		НаборДопРеквизитов = РезультатЗапроса.ВыгрузитьКолонку("Ссылка");

	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НаборыДопРеквизитов.Свойство КАК Свойство
	|ИЗ
	|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК НаборыДопРеквизитов
	|ГДЕ
	|	НаборыДопРеквизитов.Ссылка В ИЕРАРХИИ(&НаборДопРеквизитов)
	|	И НЕ НаборыДопРеквизитов.Ссылка.ЭтоГруппа
	|	И НЕ НаборыДопРеквизитов.ПометкаУдаления";

	Запрос.УстановитьПараметр("НаборДопРеквизитов", НаборДопРеквизитов);

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	Возврат РезультатЗапроса.ВыгрузитьКолонку("Свойство");

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция РеквизитыНоменклатуры() Экспорт

	Реквизиты = Метаданные.Справочники["Номенклатура"].Реквизиты;
	Результат = Новый Массив;
	Для Каждого Реквизит Из Реквизиты Цикл
		Результат.Добавить(СокрЛП(Реквизит.Синоним));
	КонецЦикла;

	СтандартныеРеквизиты = Метаданные.Справочники["Номенклатура"].СтандартныеРеквизиты;
	Для Каждого Реквизит Из СтандартныеРеквизиты Цикл
		Результат.Добавить(Реквизит.Имя);
	КонецЦикла;

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция ДопСвойстваНоменклатуры() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НаборыДополнительныхСведений.Свойство КАК Свойство
	|ИЗ
	|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеСведения КАК НаборыДополнительныхСведений
	|ГДЕ
	|	НаборыДополнительныхСведений.Ссылка В ИЕРАРХИИ
	|			(ВЫБРАТЬ
	|				НаборыДополнительныхРеквизитовИСведений.Ссылка КАК Ссылка
	|			ИЗ
	|				Справочник.НаборыДополнительныхРеквизитовИСведений КАК НаборыДополнительныхРеквизитовИСведений
	|			ГДЕ
	|				НаборыДополнительныхРеквизитовИСведений.Наименование = &Наименование)
	|	И НЕ НаборыДополнительныхСведений.Ссылка.ЭтоГруппа
	|	И НЕ НаборыДополнительныхСведений.ПометкаУдаления";

	Запрос.УстановитьПараметр("Наименование", "Номенклатура");

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	Возврат РезультатЗапроса.ВыгрузитьКолонку("Свойство");

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция НаборыДопРеквизитовХарактеристикиНоменклатуры() Экспорт

	НаименованияЭлементовСправочника = Новый Массив;
	НаименованияЭлементовСправочника.Добавить("Характеристики");
	НаименованияЭлементовСправочника.Добавить("Характеристики номенклатуры");
	НаименованияЭлементовСправочника.Добавить("Справочник ""Характеристики номенклатуры""");

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НаборыДополнительныхРеквизитовИСведений.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НаборыДополнительныхРеквизитовИСведений КАК НаборыДополнительныхРеквизитовИСведений
	|ГДЕ
	|	НЕ НаборыДополнительныхРеквизитовИСведений.ЭтоГруппа
	|	И НЕ НаборыДополнительныхРеквизитовИСведений.ПометкаУдаления
	|	И НаборыДополнительныхРеквизитовИСведений.Родитель В (ВЫБРАТЬ
	|			НаборыДополнительныхРеквизитовИСведений.Ссылка КАК Ссылка
	|		ИЗ
	|			Справочник.НаборыДополнительныхРеквизитовИСведений КАК НаборыДополнительныхРеквизитовИСведений
	|		ГДЕ
	|			НаборыДополнительныхРеквизитовИСведений.Наименование В (&НаименованияЭлементовСправочника))
	|	И НаборыДополнительныхРеквизитовИСведений.КоличествоРеквизитов > 0";

	Запрос.УстановитьПараметр("НаименованияЭлементовСправочника", НаименованияЭлементовСправочника);

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	Возврат РезультатЗапроса.ВыгрузитьКолонку("Ссылка");

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция ВидыНоменклатурыХарактеристик() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ХарактеристикиНоменклатуры.ВидНоменклатуры КАК ВидНоменклатуры,
	|	КОЛИЧЕСТВО(ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство) КАК Свойство
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
	|		ПО (ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка = ХарактеристикиНоменклатуры.Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ХарактеристикиНоменклатуры.ВидНоменклатуры
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство) = 0
	|";
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	Возврат РезультатЗапроса.ВыгрузитьКолонку("ВидНоменклатуры");

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция РеквизитыХарактеристикиНоменклатуры() Экспорт

	Реквизиты = Метаданные.Справочники["ХарактеристикиНоменклатуры"].Реквизиты;
	Результат = Новый Массив;
	Для Каждого Реквизит Из Реквизиты Цикл
		Результат.Добавить(Реквизит.Синоним);
	КонецЦикла;

	СтандартныеРеквизиты = Метаданные.Справочники["ХарактеристикиНоменклатуры"].СтандартныеРеквизиты;
	Для Каждого Реквизит Из СтандартныеРеквизиты Цикл
		Результат.Добавить(Реквизит.Имя);
	КонецЦикла;

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Заварин К.В. 20.05.24 УА #71157
//Добавлен множитель
Процедура ДобавитьСопоставлениеОсновногоРеквизита(Категория, РеквизитТовара, ВидРеквизита1С, Реквизит1С,
	ФиксированноеЗначение, ИмяРегистра, Множитель = 0) Экспорт
//- ИнфоСофт Заварин К.В. 20.05.24 УА #71157

	НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Категория.Установить(Категория);
	НаборЗаписей.Отбор.РеквизитТовара.Установить(РеквизитТовара);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();

	ЗаписьНабора = НаборЗаписей.Добавить();
	ЗаписьНабора.Категория 				= Категория;
	ЗаписьНабора.РеквизитТовара 		= РеквизитТовара;
	ЗаписьНабора.ВидРеквизита1С 		= ВидРеквизита1С;
	ЗаписьНабора.Реквизит1С 			= Реквизит1С;
	ЗаписьНабора.ФиксированноеЗначение 	= ФиксированноеЗначение;
	//+ ИнфоСофт Заварин К.В. 20.05.24 УА #71157
	ЗаписьНабора.Множитель 				= Множитель;      
	//- ИнфоСофт Заварин К.В. 20.05.24 УА #71157
	НаборЗаписей.Записать(Истина);

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574
Процедура УдалитьСопоставлениеОсновногоРеквизита(Категория, РеквизитТовара, ИмяРегистра) Экспорт

	НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Категория.Установить(Категория);
	НаборЗаписей.Отбор.РеквизитТовара.Установить(РеквизитТовара);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать(Истина);

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 12.05.2024 УА #62574

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция СоответствиеРеквизитовНоменклатуры() Экспорт

	СоответствиеРеквизитов = Новый Соответствие;

	РеквизитыНоменклатуры = Метаданные.Справочники["Номенклатура"].Реквизиты;
	Для Каждого реквизит Из РеквизитыНоменклатуры Цикл
		СоответствиеРеквизитов.Вставить(СокрЛП(реквизит.Синоним), реквизит);
	КонецЦикла;

	СтандартныеРеквизитыНоменклатуры = Метаданные.Справочники["Номенклатура"].СтандартныеРеквизиты;
	Для Каждого реквизит Из СтандартныеРеквизитыНоменклатуры Цикл
		СоответствиеРеквизитов.Вставить(реквизит.Имя, реквизит);
	КонецЦикла;

	Возврат СоответствиеРеквизитов;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Функция ЭтоПримитивныйТип(ТипРеквизита) Экспорт

	Результат = Ложь;

	Если ТипЗнч(ТипРеквизита) = Тип("ОписаниеТипов") Тогда

		Если ТипРеквизита.СодержитТип(Тип("Строка")) Или ТипРеквизита.СодержитТип(Тип("Число"))
			Или ТипРеквизита.СодержитТип(Тип("Булево")) Или ТипРеквизита.СодержитТип(Тип("Дата")) Тогда

			Результат = Истина;

		КонецЕсли;
	ИначеЕсли ТипЗнч(ТипРеквизита) = Тип("Тип") Тогда

		Если ТипРеквизита = Тип("Строка") Или ТипРеквизита = Тип("Число") Или ТипРеквизита = Тип("Булево")
			Или ТипРеквизита = Тип("Дата") Тогда

			Результат = Истина;

		КонецЕсли;

	КонецЕсли;

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983
Процедура УстановитьСвязиПараметровВыбораХарактеристикиИУпаковки(Форма, ИмяТЧ = "Товары") Экспорт

	ЭлементХарактеристика = Форма.Элементы.Найти("ХарактеристикаНоменклатуры");
	ЭлементУпаковка = Форма.Элементы.Найти("Упаковка");

	КраткоеНаименованиеОсновнойПодсистемы = КраткоеНаименованиеОсновнойПодсистемы();

	СвязиПараметровВыбора = Новый Массив;
	ПараметрыВыбораУпаковки = Новый Массив;

	Если КраткоеНаименованиеОсновнойПодсистемы = "УНФ" Тогда
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", СтрШаблон(
			"Элементы.%1.ТекущиеДанные.Номенклатура", ИмяТЧ), РежимИзмененияСвязанногоЗначения.Очищать));
		ПараметрыВыбораУпаковки.Добавить(Новый ПараметрВыбора("НеИспользоватьКлассификатор", Истина));
	Иначе
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Номенклатура", СтрШаблон(
			"Элементы.%1.ТекущиеДанные.Номенклатура", ИмяТЧ), РежимИзмененияСвязанногоЗначения.Очищать));
	КонецЕсли;

	Если Не ЭлементХарактеристика = Неопределено Тогда
		ЭлементХарактеристика.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиПараметровВыбора);
	КонецЕсли;

	Если Не ЭлементУпаковка = Неопределено Тогда
		ЭлементУпаковка.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиПараметровВыбора);
		ЭлементУпаковка.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораУпаковки);
	КонецЕсли;
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 22.01.2024 УА #61983

//+ ИнфоСофт Стояк Ю.К. 28.05.2024 УА #65724
Функция КраткоеНаименованиеОсновнойПодсистемы() Экспорт

	Результат = "";

	ПоддерживаемыеПодсистемы = Новый Соответствие;
	ПоддерживаемыеПодсистемы.Вставить("УправлениеТорговлей", "УТ");
	ПоддерживаемыеПодсистемы.Вставить("УправлениеНебольшойФирмой", "УНФ");	

	Модуль_СтандартныеПодсистемыСервер = ОбщегоНазначения.ОбщийМодуль("СтандартныеПодсистемыСервер");
	Модуль_СтандартныеПодсистемыПовтИсп = ОбщегоНазначения.ОбщийМодуль("СтандартныеПодсистемыПовтИсп");

	ОписаниеПодсистемКонфигурации = Модуль_СтандартныеПодсистемыПовтИсп.ОписанияПодсистем().ПоИменам;

	Для Каждого КлючИЗначение Из ПоддерживаемыеПодсистемы Цикл
		ОписаниеПодсистемы = ОписаниеПодсистемКонфигурации.Получить(КлючИЗначение.Ключ + ?(
			Модуль_СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации(), "Базовая", ""));
		Если ОписаниеПодсистемы <> Неопределено Тогда
			Результат = КлючИЗначение.Значение;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции //- ИнфоСофт Стояк Ю.К. 28.05.2024 УА #65724

#КонецОбласти
